virtueTexts = {"सहनशीलता":"विविधता जीवन के बगीचे की महिमा होती है। यही कारण है कि आपके  दोस्त गुलदस्ते  में विभिन्न फूलों के सामान  है।","संतोष":"अपनी उपलब्धियों को लिख कर देखे  तो आप पाए गे कि आपके पास  सब कुछ  है जिसकी आपको ज़रुरत है ।","करुणा":"दयालु मूरत सदैव सबको सकारात्मक रूप  से प्रभावित करती है।","भाईचारा":"परम पिता को जान लेने के बाद , समस्त विष्व आपने परिवार के जैसा लगता है।","सरलता":"आपने जीवन की जटिलताओं को नज़रअंदाज़ करके , आप सादगी मे रहके सुख पाए।  ","साहस":"अपने साह्स के बल पे आपने अपने जीवन् मे वीज्य प्राप्त की है.","धीरज":"अपनी सफलता के वृक्ष का बीज, आप स्थिरता की भूमि में लगाइए।","अनुशासन":"आप  प्रकार्ति के नियमों का पालन करो  और बदले में संरक्षण, बहुतायत और मन की शांति प्राप्त करो। ","विनम्रता":"आप अपने ऊँच विचारों की शक्ति से असभ्य को भी  सभ्य  में परिवर्तित कर सकते है।","विनय":"आप एक रूहानी योद्धा हो ,जो अहंकार के हथियारों का त्यग कर नम्रता से शत्रु पे विजय प्राप्त करता है।","सहजता":"आपकी स्वतःप्रवृत्ति एक निर्मल नदी के समान है , जो सभी को तृप्ति का अनुभव कराती है।","ज़िम्मेदारी":"अपनी भूमिका को जानकार , आप  नायक बन ,इस संसार  के नाटक में आपन किरदार निभाते हैं।","सामंजस्य":"अपने को चिंताओं से  मुक्तः कर , आत्म रूप को याद रख कर ,जीवन एक नृत्य के समान हो जाता है। ","बुद्धिमत्ता":"आप ज्ञान की गहराई को समझ हर स्थिति से  कुछ नया सीखते है। ","विश्वास":"आप किसी भी संदेह रुपी विघ्न को अपने रास्ते से हटाने में सफल होते है। ","मित्रता":"आप आपने सब से अचछे मित्र है। ","आत्मविश्वास":"आप विनम्रता के साथ अपने अच्छे स्वभाव को स्वीकार करते हैं और उन्नति की ओर बढ़ते है। ","निर्मोही ":"आप जानते हैं कि कम अपेक्षा रखने का मतलब कम निराशा है। ","ख़ुशी":"आप परमात्मा से प्रसाद  के रूप में रोज़  छोटे-छोटे चमत्कारो का अनुभव करते हो। ","उमंग":"आपके अंतरमन को सुनके , आप उड़ान भरने के लिए आत्मा को पंख देते है।","प्रभेद":"संदेह में, आप जानते हैं कि जब आप अपनी वृत्ति पर विश्वास कर सकते हैं"};
virtueMap = {0: "सहनशीलता", 1: "सहनशीलता", 2: "सहनशीलता", 3: "सहनशीलता", 4: "सहनशीलता", 5: "सहनशीलता", 6: "सहनशीलता", 7: "सहनशीलता", 8: "सहनशीलता", 9: "सहनशीलता", 10: "सहनशीलता", 11: "सहनशीलता", 12: "सहनशीलता", 13: "सहनशीलता", 14: "सहनशीलता", 15: "सहनशीलता", 16: "सहनशीलता", 17: "संतोष", 18: "संतोष", 19: "संतोष", 20: "संतोष", 21: "संतोष", 22: "संतोष", 23: "संतोष", 24: "संतोष", 25: "संतोष", 26: "संतोष", 27: "संतोष", 28: "संतोष", 29: "संतोष", 30: "संतोष", 31: "संतोष", 32: "संतोष", 33: "संतोष", 34: "करुणा", 35: "करुणा", 36: "करुणा", 37: "करुणा", 38: "करुणा", 39: "करुणा", 40: "करुणा", 41: "करुणा", 42: "करुणा", 43: "करुणा", 44: "करुणा", 45: "करुणा", 46: "करुणा", 47: "करुणा", 48: "करुणा", 49: "करुणा", 50: "करुणा", 51: "भाईचारा", 52: "भाईचारा", 53: "भाईचारा", 54: "भाईचारा", 55: "भाईचारा", 56: "भाईचारा", 57: "भाईचारा", 58: "भाईचारा", 59: "भाईचारा", 60: "भाईचारा", 61: "भाईचारा", 62: "भाईचारा", 63: "भाईचारा", 64: "भाईचारा", 65: "भाईचारा", 66: "भाईचारा", 67: "भाईचारा", 68: "भाईचारा", 69: "सरलता", 70: "सरलता", 71: "सरलता", 72: "सरलता", 73: "सरलता", 74: "सरलता", 75: "सरलता", 76: "सरलता", 77: "सरलता", 78: "सरलता", 79: "सरलता", 80: "सरलता", 81: "सरलता", 82: "सरलता", 83: "सरलता", 84: "सरलता", 85: "सरलता", 86: "साहस", 87: "साहस", 88: "साहस", 89: "साहस", 90: "साहस", 91: "साहस", 92: "साहस", 93: "साहस", 94: "साहस", 95: "साहस", 96: "साहस", 97: "साहस", 98: "साहस", 99: "साहस", 100: "साहस", 101: "साहस", 102: "साहस", 103: "धीरज", 104: "धीरज", 105: "धीरज", 106: "धीरज", 107: "धीरज", 108: "धीरज", 109: "धीरज", 110: "धीरज", 111: "धीरज", 112: "धीरज", 113: "धीरज", 114: "धीरज", 115: "धीरज", 116: "धीरज", 117: "धीरज", 118: "धीरज", 119: "धीरज", 120: "अनुशासन", 121: "अनुशासन", 122: "अनुशासन", 123: "अनुशासन", 124: "अनुशासन", 125: "अनुशासन", 126: "अनुशासन", 127: "अनुशासन", 128: "अनुशासन", 129: "अनुशासन", 130: "अनुशासन", 131: "अनुशासन", 132: "अनुशासन", 133: "अनुशासन", 134: "अनुशासन", 135: "अनुशासन", 136: "अनुशासन", 137: "विनम्रता", 138: "विनम्रता", 139: "विनम्रता", 140: "विनम्रता", 141: "विनम्रता", 142: "विनम्रता", 143: "विनम्रता", 144: "विनम्रता", 145: "विनम्रता", 146: "विनम्रता", 147: "विनम्रता", 148: "विनम्रता", 149: "विनम्रता", 150: "विनम्रता", 151: "विनम्रता", 152: "विनम्रता", 153: "विनम्रता", 154: "विनय", 155: "विनय", 156: "विनय", 157: "विनय", 158: "विनय", 159: "विनय", 160: "विनय", 161: "विनय", 162: "विनय", 163: "विनय", 164: "विनय", 165: "विनय", 166: "विनय", 167: "विनय", 168: "विनय", 169: "विनय", 170: "विनय", 171: "सहजता", 172: "सहजता", 173: "सहजता", 174: "सहजता", 175: "सहजता", 176: "सहजता", 177: "सहजता", 178: "सहजता", 179: "सहजता", 180: "सहजता", 181: "सहजता", 182: "सहजता", 183: "सहजता", 184: "सहजता", 185: "सहजता", 186: "सहजता", 187: "सहजता", 188: "सहजता", 189: "ज़िम्मेदारी", 190: "ज़िम्मेदारी", 191: "ज़िम्मेदारी", 192: "ज़िम्मेदारी", 193: "ज़िम्मेदारी", 194: "ज़िम्मेदारी", 195: "ज़िम्मेदारी", 196: "ज़िम्मेदारी", 197: "ज़िम्मेदारी", 198: "ज़िम्मेदारी", 199: "ज़िम्मेदारी", 200: "ज़िम्मेदारी", 201: "ज़िम्मेदारी", 202: "ज़िम्मेदारी", 203: "ज़िम्मेदारी", 204: "ज़िम्मेदारी", 205: "ज़िम्मेदारी", 206: "सामंजस्य", 207: "सामंजस्य", 208: "सामंजस्य", 209: "सामंजस्य", 210: "सामंजस्य", 211: "सामंजस्य", 212: "सामंजस्य", 213: "सामंजस्य", 214: "सामंजस्य", 215: "सामंजस्य", 216: "सामंजस्य", 217: "सामंजस्य", 218: "सामंजस्य", 219: "सामंजस्य", 220: "सामंजस्य", 221: "सामंजस्य", 222: "सामंजस्य", 223: "बुद्धिमत्ता", 224: "बुद्धिमत्ता", 225: "बुद्धिमत्ता", 226: "बुद्धिमत्ता", 227: "बुद्धिमत्ता", 228: "बुद्धिमत्ता", 229: "बुद्धिमत्ता", 230: "बुद्धिमत्ता", 231: "बुद्धिमत्ता", 232: "बुद्धिमत्ता", 233: "बुद्धिमत्ता", 234: "बुद्धिमत्ता", 235: "बुद्धिमत्ता", 236: "बुद्धिमत्ता", 237: "बुद्धिमत्ता", 238: "बुद्धिमत्ता", 239: "बुद्धिमत्ता", 240: "विश्वास", 241: "विश्वास", 242: "विश्वास", 243: "विश्वास", 244: "विश्वास", 245: "विश्वास", 246: "विश्वास", 247: "विश्वास", 248: "विश्वास", 249: "विश्वास", 250: "विश्वास", 251: "विश्वास", 252: "विश्वास", 253: "विश्वास", 254: "विश्वास", 255: "विश्वास", 256: "विश्वास", 257: "मित्रता", 258: "मित्रता", 259: "मित्रता", 260: "मित्रता", 261: "मित्रता", 262: "मित्रता", 263: "मित्रता", 264: "मित्रता", 265: "मित्रता", 266: "मित्रता", 267: "मित्रता", 268: "मित्रता", 269: "मित्रता", 270: "मित्रता", 271: "मित्रता", 272: "मित्रता", 273: "मित्रता", 274: "आत्मविश्वास", 275: "आत्मविश्वास", 276: "आत्मविश्वास", 277: "आत्मविश्वास", 278: "आत्मविश्वास", 279: "आत्मविश्वास", 280: "आत्मविश्वास", 281: "आत्मविश्वास", 282: "आत्मविश्वास", 283: "आत्मविश्वास", 284: "आत्मविश्वास", 285: "आत्मविश्वास", 286: "आत्मविश्वास", 287: "आत्मविश्वास", 288: "आत्मविश्वास", 289: "आत्मविश्वास", 290: "आत्मविश्वास", 291: "निर्मोही ", 292: "निर्मोही ", 293: "निर्मोही ", 294: "निर्मोही ", 295: "निर्मोही ", 296: "निर्मोही ", 297: "निर्मोही ", 298: "निर्मोही ", 299: "निर्मोही ", 300: "निर्मोही ", 301: "निर्मोही ", 302: "निर्मोही ", 303: "निर्मोही ", 304: "निर्मोही ", 305: "निर्मोही ", 306: "निर्मोही ", 307: "निर्मोही ", 308: "निर्मोही ", 309: "ख़ुशी", 310: "ख़ुशी", 311: "ख़ुशी", 312: "ख़ुशी", 313: "ख़ुशी", 314: "ख़ुशी", 315: "ख़ुशी", 316: "ख़ुशी", 317: "ख़ुशी", 318: "ख़ुशी", 319: "ख़ुशी", 320: "ख़ुशी", 321: "ख़ुशी", 322: "ख़ुशी", 323: "ख़ुशी", 324: "ख़ुशी", 325: "ख़ुशी", 326: "उमंग", 327: "उमंग", 328: "उमंग", 329: "उमंग", 330: "उमंग", 331: "उमंग", 332: "उमंग", 333: "उमंग", 334: "उमंग", 335: "उमंग", 336: "उमंग", 337: "उमंग", 338: "उमंग", 339: "उमंग", 340: "उमंग", 341: "उमंग", 342: "उमंग", 343: "प्रभेद", 344: "प्रभेद", 345: "प्रभेद", 346: "प्रभेद", 347: "प्रभेद", 348: "प्रभेद", 349: "प्रभेद", 350: "प्रभेद", 351: "प्रभेद", 352: "प्रभेद", 353: "प्रभेद", 354: "प्रभेद", 355: "प्रभेद", 356: "प्रभेद", 357: "प्रभेद", 358: "प्रभेद", 359: "प्रभेद"};
backColors = {"सहनशीलता": "#f13359", "संतोष": "#a62a90", "करुणा": "#186cba", "भाईचारा": "#3eb2cf", "सरलता": "#4ac0a5", "साहस": "#b2d61c", "धीरज": "#81a16c", "अनुशासन": "#3ca08a", "विनम्रता": "#176299", "विनय": "#8c669f", "सहजता": "#261e63", "ज़िम्मेदारी": "#11103c", "सामंजस्य": "#de6679", "बुद्धिमत्ता": "#f2c495", "विश्वास": "#c08000", "मित्रता": "#fed900", "आत्मविश्वास": "#faa800", "निर्मोही ": "#fc6720", "ख़ुशी": "#f54a00", "उमंग": "#d0331f", "प्रभेद": "#9d221d"};
foregroundColor = {"सहनशीलता": "#ffffff", "संतोष": "#ffffff", "करुणा": "#ffffff", "भाईचारा": "#ffffff", "सरलता": "#ffffff", "साहस": "#ffffff", "धीरज": "#ffffff", "अनुशासन": "#ffffff", "विनम्रता": "#ffffff", "विनय": "#ffffff", "सहजता": "#ffffff", "ज़िम्मेदारी": "#ffffff", "सामंजस्य": "#ffffff", "बुद्धिमत्ता": "#ffffff", "विश्वास": "#ffffff", "मित्रता": "#ffffff", "आत्मविश्वास": "#ffffff", "निर्मोही ": "#ffffff", "ख़ुशी": "#ffffff", "उमंग": "#ffffff", "प्रभेद": "#ffffff"};
params = {"angleCorrection":"1.003","backgroundColor":"#ffffff","textColour":"#000000","doStroke":false,"font":"normal 12pt Sans-serif","distanceFromCenter":"120","totalX":600,"totalY":600,"pieSize":250,"drawCircle":true,"simpleGradientStart":"#ff0000","simpleGradientEnd":"#0000ff","innerCircleWidth":70};

var months = ["जनवरी", "फ़रवरी", "मार्च", "अप्रैल", "मई", "जून", "जुलाई", "अगस्त", "सितंबर", "अक्टूबर", "नवंबर", "दिसंबर"]
var i18n = {
    "OK": "ओके",
    "Cancel": "रद्द करें",
    "Hide history": "इतिहास छुपाएँ",
    "No history yet": "अभी तक कोई इतिहास नहीं है",
    "Date": "तिथि",
    "Virtue": "गुण",
    "Hide": "छुपाएँ",
    "Show": "दिखाएँ",
    "Work in progress": "कार्य प्रगति पर है",
    "Next month": "अगले महीने",
    "Show history": "इतिहास दिखाएँ",
    "Hide Images": "छवियाँ छुपाएं",
    "Show Images": "फ़ोटो दिखाएँ",
    "Cards with text will be displayed.": "टेक्स्ट  के साथ कार्ड प्रदर्शित किया जाएगा ",
    "Start Year Plan": "वर्ष फल बनाए ",
    "Restart": "पुनरारंभ करें",
    "Running": "चल रहा है",
    "Download PDF": "डाउनलोड PDF",
    "Send Email": "ईमेल भेजें",
    "Pause": "रोकें",
    "Play": "शुरू करे ",
    "Play again": " दोबारा चलाएँ",
    "Virtuescope": "गुण-क्षेत्र ",
    "Virtuescope Predictions": "आने वाले दिनों के लिए प्रस्ताव",
    "Please enter your email": "कृपया अपना ईमेल आईडी दर्ज करें",
    "Please wait": "कृपया प्रतीक्षा करें...",
    "Email sent successfully !": "आपका ईमेल भेज दिया गया है",
    "Email could not be sent (how embarassing !). Please download the PDF.": "ईमेल भेजा नहीं जा सका ( माफ़ करें!) । PDF डाउनलोड करें।",
    "introText": "हर रोज पहिया घुमाइए और जादू का आनंद ले - दिन भर वह गुण अपनी जागरूकता में रखें और देखें कि यह कैसे आपके दुनिया में रंग लती है."
};
var plans = {
    "12 months": "12 महीने ",
    "6 months": "6 महीने ",
    "4 months": "4 महीने ",
    "3 months": "3 महीने ",
    "7 days": "7 दिन",
    "15 days": "15 दिन"
};

var plansLength = {
    "12 months": "12",
    "6 months": "6",
    "4 months": "4",
    "3 months": "3",
    "7 days": "7d",
    "15 days": "15d"
};

var getGlobalLocale = function() {
    return "hi_IN";
};