virtueTexts = {"寛容性":"多様性は「人生」という庭を美しくします。ですから、さまざまなタイプの友人＝ブーケの中の異なった形の花々を好むのです。","満足感":"得ているものをリストアップするだけで、必要なものはすべて持っていることに気づきます。","思いやり":"ある人の欲求に対して判断を下すことなく受けとめ、その人によい願いを送ります。\n\n","兄弟の視線":"あなたは魂としてのお父さんを認識しているので、人類は皆父の子供であり、あなたの兄弟になることをわかっています。\n","簡素さ":"あなたは人生の魅力として何が大切かを知っています。複雑さを手放し心の重荷を軽くしています。","勇気":"自分が変わることを認めたなら、あなたは内なる最大の戦いに勝利します。","忍耐":"小さな種の中には未来の木という成功があることがわかっているので、絶え間なく続けるという土壌の中で成功という木を育てます。","秩序":"宇宙の自然の法則に従えば、あなたはお返しに自然に守られ心の豊かさや平和を受け取ります。","繊細さ":"「考えと行動」という魔法の杖を使って、俗っぽい考えや行動を繊細なものに変えていきます。","謙虚さ":"あなたはスピリチュアルな勇士です。傲慢さという兵器を投げ出します。褒められることにも喜びを求めません。","自発性":"人々の心の渇きを癒し、心の重荷を軽くするあなたの自発性は、川のせせらぎのようです。\n","責任":"自分には独自の役割があることが分かると、人生というドラマの中であなたは傍観者ではなくヒーローになります。\n","調和":"しがみついているものを手放したら、人生が踊り始めることがわかります。","知恵":"教師が持つ「深い知恵」と子どもが持つ「心の軽さ」のバランスをとれば、あらゆる状況で新しい学びがあります。","信頼":"行く手を阻むあらゆる疑いを取り除きます。","友情":"あなたの親友はあなた自身です。","幸福":"日々の生活で、大いなる存在からきらめきのようなちょっとした奇跡を受け取ります。\n","自信":"自分の良さを謙虚に受け入れます。ただ思い切って「最高のわたし」でいればよいだけです。","離れて眺める":"期待しなければがっかりすることもないことを私はわかっています。","熱意":"内なる子どもの声を聞くことは、魂が飛び立つための翼を与えることです。","見分ける力":"何かに疑いがある時、信じられるのは自分の直感だということを知っています。","純粋性":"目を通して心の美が輝きを放ちます。一つ一つの資質はまるでカットされたダイヤモンドの断面のようです。","希望":"試練はより強くなるために自分を支えてくれる友人のようです。ですからあなたは常に挑戦するのです。","自由":"判断せずに見ます。影響されずに聞きます。欲張らずに楽しみます。","創造性":"創造性の基礎は私の内側にある平和です。","集中力":"心が深い沈黙にあり、あふれんばかりの豊かさで満ちていて、物質的なものを切望することがなく、ひとつのものに対して完全に集中している時、矢のように考えを見出し、目的に溶け込んでいきます。","強さ":"自分が精神的な存在であることを自覚し体験を通して、大いなる存在と繋がることができます。そして私は世界に対して前向きに貢献をするべきだ、という強さと広い視野を受け取ります。","穏やかさ":"自分が何であるかという知識は、穏やかさや精神的な美をもたらす真実と同等なものです。","敬意":"人を尊重するとはその人を判断せず、批評せず、責めず、コントロールしないということです。語ったことや行ったことに関わらずその人を受けいれます。\n"," 軽さ":"わたしの真の目的は、人々のため灯台のような存在でいることです。灯台は光に満ち、軽さのフィーリングに満ちています。重荷のプレッシャーがないので、人々と光を分かち合う事ができ、道を示すことができるのです。","正直さ":"正直さとはありのままでいるだけではなく、良いことや肯定的なことを自分自身に与えていくことです。","寛大さ":"寛大さとは単に何かを与える以上の意味があります。他の人と協力するという意味\nも含まれます。最も素晴らしい寛大な行為とは、他の人の弱さや間違いを見ずに、それを超えたところを見ていくことにあります。\n","柔軟性":"謙虚でいて愛があれば、柔軟性は自然と表れます。もしも協力的でない人に出会ったら、謙虚になってその人が伝えたいことを理解するようにします。\n","節約":"節約とは、無駄な考えで時間を失わないように心を集中させることです。","決意":"決意は精神的な旅路を続けていく上で必要不可欠で育むべき特質です。どれほど強い熱意と明確な目的があっても決意の気持ちがなかったらどの道ギブアップしてしまうことでしょう。この旅路にチャレンジする時決意の気持ちが頑固さに結びついていないかに気をつけます。すると抵抗する気持ちを手放すことができて、心は誰にも何にも反対できません。"};
virtueMap = {0: "寛容性", 1: "寛容性", 2: "寛容性", 3: "寛容性", 4: "寛容性", 5: "寛容性", 6: "寛容性", 7: "寛容性", 8: "寛容性", 9: "寛容性", 10: "満足感", 11: "満足感", 12: "満足感", 13: "満足感", 14: "満足感", 15: "満足感", 16: "満足感", 17: "満足感", 18: "満足感", 19: "満足感", 20: "満足感", 21: "思いやり", 22: "思いやり", 23: "思いやり", 24: "思いやり", 25: "思いやり", 26: "思いやり", 27: "思いやり", 28: "思いやり", 29: "思いやり", 30: "思いやり", 31: "兄弟の視線", 32: "兄弟の視線", 33: "兄弟の視線", 34: "兄弟の視線", 35: "兄弟の視線", 36: "兄弟の視線", 37: "兄弟の視線", 38: "兄弟の視線", 39: "兄弟の視線", 40: "兄弟の視線", 41: "簡素さ", 42: "簡素さ", 43: "簡素さ", 44: "簡素さ", 45: "簡素さ", 46: "簡素さ", 47: "簡素さ", 48: "簡素さ", 49: "簡素さ", 50: "簡素さ", 51: "勇気", 52: "勇気", 53: "勇気", 54: "勇気", 55: "勇気", 56: "勇気", 57: "勇気", 58: "勇気", 59: "勇気", 60: "勇気", 61: "勇気", 62: "忍耐", 63: "忍耐", 64: "忍耐", 65: "忍耐", 66: "忍耐", 67: "忍耐", 68: "忍耐", 69: "忍耐", 70: "忍耐", 71: "忍耐", 72: "秩序", 73: "秩序", 74: "秩序", 75: "秩序", 76: "秩序", 77: "秩序", 78: "秩序", 79: "秩序", 80: "秩序", 81: "秩序", 82: "繊細さ", 83: "繊細さ", 84: "繊細さ", 85: "繊細さ", 86: "繊細さ", 87: "繊細さ", 88: "繊細さ", 89: "繊細さ", 90: "繊細さ", 91: "繊細さ", 92: "繊細さ", 93: "謙虚さ", 94: "謙虚さ", 95: "謙虚さ", 96: "謙虚さ", 97: "謙虚さ", 98: "謙虚さ", 99: "謙虚さ", 100: "謙虚さ", 101: "謙虚さ", 102: "謙虚さ", 103: "自発性", 104: "自発性", 105: "自発性", 106: "自発性", 107: "自発性", 108: "自発性", 109: "自発性", 110: "自発性", 111: "自発性", 112: "自発性", 113: "責任", 114: "責任", 115: "責任", 116: "責任", 117: "責任", 118: "責任", 119: "責任", 120: "責任", 121: "責任", 122: "責任", 123: "調和", 124: "調和", 125: "調和", 126: "調和", 127: "調和", 128: "調和", 129: "調和", 130: "調和", 131: "調和", 132: "調和", 133: "調和", 134: "知恵", 135: "知恵", 136: "知恵", 137: "知恵", 138: "知恵", 139: "知恵", 140: "知恵", 141: "知恵", 142: "知恵", 143: "知恵", 144: "信頼", 145: "信頼", 146: "信頼", 147: "信頼", 148: "信頼", 149: "信頼", 150: "信頼", 151: "信頼", 152: "信頼", 153: "信頼", 154: "友情", 155: "友情", 156: "友情", 157: "友情", 158: "友情", 159: "友情", 160: "友情", 161: "友情", 162: "友情", 163: "友情", 164: "友情", 165: "幸福", 166: "幸福", 167: "幸福", 168: "幸福", 169: "幸福", 170: "幸福", 171: "幸福", 172: "幸福", 173: "幸福", 174: "幸福", 175: "自信", 176: "自信", 177: "自信", 178: "自信", 179: "自信", 180: "自信", 181: "自信", 182: "自信", 183: "自信", 184: "自信", 185: "離れて眺める", 186: "離れて眺める", 187: "離れて眺める", 188: "離れて眺める", 189: "離れて眺める", 190: "離れて眺める", 191: "離れて眺める", 192: "離れて眺める", 193: "離れて眺める", 194: "離れて眺める", 195: "熱意", 196: "熱意", 197: "熱意", 198: "熱意", 199: "熱意", 200: "熱意", 201: "熱意", 202: "熱意", 203: "熱意", 204: "熱意", 205: "熱意", 206: "見分ける力", 207: "見分ける力", 208: "見分ける力", 209: "見分ける力", 210: "見分ける力", 211: "見分ける力", 212: "見分ける力", 213: "見分ける力", 214: "見分ける力", 215: "見分ける力", 216: "純粋性", 217: "純粋性", 218: "純粋性", 219: "純粋性", 220: "純粋性", 221: "純粋性", 222: "純粋性", 223: "純粋性", 224: "純粋性", 225: "純粋性", 226: "希望", 227: "希望", 228: "希望", 229: "希望", 230: "希望", 231: "希望", 232: "希望", 233: "希望", 234: "希望", 235: "希望", 236: "希望", 237: "自由", 238: "自由", 239: "自由", 240: "自由", 241: "自由", 242: "自由", 243: "自由", 244: "自由", 245: "自由", 246: "自由", 247: "創造性", 248: "創造性", 249: "創造性", 250: "創造性", 251: "創造性", 252: "創造性", 253: "創造性", 254: "創造性", 255: "創造性", 256: "創造性", 257: "集中力", 258: "集中力", 259: "集中力", 260: "集中力", 261: "集中力", 262: "集中力", 263: "集中力", 264: "集中力", 265: "集中力", 266: "集中力", 267: "強さ", 268: "強さ", 269: "強さ", 270: "強さ", 271: "強さ", 272: "強さ", 273: "強さ", 274: "強さ", 275: "強さ", 276: "強さ", 277: "強さ", 278: "穏やかさ", 279: "穏やかさ", 280: "穏やかさ", 281: "穏やかさ", 282: "穏やかさ", 283: "穏やかさ", 284: "穏やかさ", 285: "穏やかさ", 286: "穏やかさ", 287: "穏やかさ", 288: "敬意", 289: "敬意", 290: "敬意", 291: "敬意", 292: "敬意", 293: "敬意", 294: "敬意", 295: "敬意", 296: "敬意", 297: "敬意", 298: " 軽さ", 299: " 軽さ", 300: " 軽さ", 301: " 軽さ", 302: " 軽さ", 303: " 軽さ", 304: " 軽さ", 305: " 軽さ", 306: " 軽さ", 307: " 軽さ", 308: " 軽さ", 309: "正直さ", 310: "正直さ", 311: "正直さ", 312: "正直さ", 313: "正直さ", 314: "正直さ", 315: "正直さ", 316: "正直さ", 317: "正直さ", 318: "正直さ", 319: "寛大さ", 320: "寛大さ", 321: "寛大さ", 322: "寛大さ", 323: "寛大さ", 324: "寛大さ", 325: "寛大さ", 326: "寛大さ", 327: "寛大さ", 328: "寛大さ", 329: "柔軟性", 330: "柔軟性", 331: "柔軟性", 332: "柔軟性", 333: "柔軟性", 334: "柔軟性", 335: "柔軟性", 336: "柔軟性", 337: "柔軟性", 338: "柔軟性", 339: "節約", 340: "節約", 341: "節約", 342: "節約", 343: "節約", 344: "節約", 345: "節約", 346: "節約", 347: "節約", 348: "節約", 349: "節約", 350: "決意", 351: "決意", 352: "決意", 353: "決意", 354: "決意", 355: "決意", 356: "決意", 357: "決意", 358: "決意", 359: "決意"};
backColors = {"寛容性": "#d9dce3", "満足感": "#d7ad9f", "思いやり": "#00CC99", "兄弟の視線": "#e776ae", "簡素さ": "#8edaf0", "勇気": "#A2A2D0", "忍耐": "#ec95c0", "秩序": "#e2c6bc", "繊細さ": "#FD7C6E", "謙虚さ": "#c07eb8", "自発性": "#d5a8cf", "責任": "#ea5e93", "調和": "#FFBCD9", "知恵": "#FFA474", "信頼": "#FFCFAB", "友情": "#b0a9da", "幸福": "#cfc0b8", "自信": "#FFBCD9", "離れて眺める": "#ffbebb", "熱意": "#db93be", "見分ける力": "#ffd1bd", "純粋性": "#fdfec2", "希望": "#EFDECD", "自由": "#f5c5b6", "創造性": "#FFAACC", "集中力": "#ffaceb", "強さ": "#dadaed", "穏やかさ": "#9ACEEB", "敬意": "#FFCFAB", " 軽さ": "#FDD9B5", "正直さ": "#E6A8D7", "寛大さ": "#FFCFAB", "柔軟性": "#E6A8D7", "節約": "#F78FA7", "決意": "#a4e0f2"};
foregroundColor = {"寛容性": "black", "満足感": "#ffffff", "思いやり": "#ffffff", "兄弟の視線": "#ffffff", "簡素さ": "black", "勇気": "black", "忍耐": "#000000", "秩序": "#000000", "繊細さ": "black", "謙虚さ": "#ffffff", "自発性": "#ffffff", "責任": "black", "調和": "black", "知恵": "black", "信頼": "black", "友情": "#ffffff", "幸福": "black", "自信": "black", "離れて眺める": "black", "熱意": "#ffffff", "見分ける力": "black", "純粋性": "black", "希望": "black", "自由": "black", "創造性": "black", "集中力": "black", "強さ": "black", "穏やかさ": "black", "敬意": "black", " 軽さ": "black", "正直さ": "black", "寛大さ": "black", "柔軟性": "black", "節約": "black", "決意": "#000000"};
params = {"angleCorrection":"1.0044","backgroundColor":"#ffffff","textColour":"#000000","doStroke":true,"font":"normal 14pt Sans-serif","distanceFromCenter":"116","totalX":600,"totalY":600,"pieSize":250,"drawCircle":true,"simpleGradientStart":"#ff0000","simpleGradientEnd":"#0000ff"};

var virtueImages = {
    "Tolerance": "tolerance.png",
    "Contentment": "contentment.png",
    "Compassion": "compassion.png",
    "Brotherhood": "brotherhood.png",
    "Simplicity": "simplicity.png",
    "Courage": "courage.png",
    "Patience": "patience.png",
    "Discipline": "discipline.png",
    "Delicacy": "delicacy.png",
    "Humility": "humility.png",
    "Spontaneity": "spontaneity.png",
    "Responsibility": "responsibility.png",
    "Harmony": "harmony.png",
    "Wisdom": "wisdom.png",
    "Faith": "faith.png",
    "Friendship": "friendship.png",
    "Happiness": "happiness.png",
    "Self-confidence": "self-confidence.png",
    "Detachment": "detachment.png",
    "Enthusiasm": "enthusiasm.png",
    "Discernment": "discernment.png",
    "Purity": "purity.png",
    "Hope": "hope.png",
    "Freedom": "freedom.png",
    "Creativity": "creativity.png",
    "Concentration": "concentration.png",
    "Strength": "strength.png",
    "Serenity": "serenity.png",
    "Respect": "respect.png",
    "Lightness": "lightness.png",
    "Honesty": "honesty.png",
    "Generosity": "generosity.png",
    "Flexibility": "flexibility.png",
    "Economy": "economy.png",
    "Determination": "determination.png", // invented
    "Balance": "balance.png"
};

var months = ["1月","2月","3月","4月","5月","6月","7月","8月","9月","10月","11月","12月"];
var i18n = {"OK": "OK","Cancel": "Cancel","Hide history":"履歴を表示しない","No history yet":"履歴なし","Date":"日付","Virtue":"美徳","Hide":"表示しない","Show":"表示する","Work in progress":"処理中","Next month":"翌月","Show history":"表示する","Hide Images":"画像を表示しない","Show Images":"画像を表示する","Cards with text will be displayed.":"カードが表示されます","Start Year Plan":"バーチュースコープのメールサービスを開始する","Restart":"再スタート","Running":"実行中","Download PDF":"PDFをダウンロードする","Send Email":"メールを送信する","Pause":"ストップ","Play":"スタート","Play again": "再スタート","Virtuescope":"バーチュースコープ","Please enter your email":"メールアドレスを入力してください","Please wait":"お待ちください","Email sent successfully !":"メールが無事に送信されました","Email could not be sent (how embarassing !). Please download the PDF.":"メールが送信できませんでした。PDFデータをダウンロードしてください",
    "introText": "「バーチュースコープ」のルーレットを毎日回してみましょう。\n"
        + "あなたが今日引いた資質を心にとどめておきます。\n"
        + "その資質はあなたの考え、周囲の環境、そして世界にどのような彩りを添えてくれるでしょう？---ちょっとした奇跡が起きるかもしれません。お楽しみに。"};
var plans = {"12 months":"12 か月","6 months":"6 か月","4 months":"4 か月","3 months":"3 か月","7 days":"7 日間","15 days":"15 日間"};

var plansLength = {
    "12 months": "12",
    "6 months": "6",
    "4 months": "4",
    "3 months": "3",
    "7 days": "7d",
    "15 days": "15d"
};

global.positionStopButton = function() {
    return -12;
};

var getGlobalLocale = function() {
    return "ja_JP";
};
