/* 
 Brahma Kumaris 2014
 */
virtueTexts = {"안정감":"나는 참된 것에 나의 중심을 둠으로써 안정감과 열린 마음을 갖는다. ","명랑함":"나는 삶을 가벼운 마음으로 받아들이고 미래를 밝게 내다 본다","사랑":"사랑은 특별한 조건이 필요 없다. 나는 아무 보답을 기대하지 않는 선물로서 사랑을 준다.","관용":"나는 아무 것도 기대하지 않는 성숙함을 가지고 계속 사랑을 줄 수 있다.","변함 없음":"나는 결단력 있게 꾸준히 실행에 옮기는 사람으로서 결코 일시적인 이득에 현혹되지 않는다.","겸손":"나는 남들의 관심을 구하지 않으며 그들을 귀하게 여긴다. 자아 존중은 나의 내면의 빛; 나는 그 밖에 아무 것도 필요하지 않다. ","협동심":"나는 내 시간과 재능을 남들에게도 내어 줌으로써 긍정적인 결과를 얻는다.","자신에 대한 신뢰":"나는 꿈을 잃지 않으며, \n현실을 적극적으로 수용한다.","성실성":"안과 밖이 한결 같다는 것은 내가 가장 아끼는 가치관이며, 그것은 나의 행동을 통해 드러난다.","지혜로움":"나는 반드시 먼저 관찰하고, 듣고, 수용한 다음에 행동한다.","초연함":"나는 애착 없이 사랑을 주며, 일에 관여하면서도 거기에 의존하지 않음으로써 사물을 올바로 본다.","정직함":"나의 생각은 진실하고, 말은 곧으며, 행동은 믿음직하다.","창의성":"과거의 경험을 바탕으로 새로운 방법을 끌어내는 \n나의 창의력은 나의 현재를 변화 시키고 미래를 위한 활력소가 된다.","용기":"나는 아무런 두려움 없이 내가 발견한 진리를 지켜 나간다.","긍정적 소망":"내 생각과 행동의 씨앗은 희망이다; 나는 모든 영혼들과 자연에 대해 좋은 소망을 갖는다.","실용적":"나는 결코 불가능한 목표에 이끌리지 않으며 언제나 해결책을 적극적으로 모색한다. ","유능함":"나는 감춰진 잠재력을 활용할 줄 알며, 언제나 남들에게 해결방안을 제시해 줄 수 있다.","보살핌":"나는 끊임없는 지원을 통해 진지하게 나를 내어 줌으로써 언제나 길을 열어 준다.","책임감":"나는 결과에 관심을 갖고, 남에게 항상 협조하며, 나 자신을 잘 돌본다.","신뢰":"인생의 우여곡절들 속에는 전화위복의 기회가 숨어 있음을 알기에 나는 내 앞에 펼쳐지는 길을 묵묵히 받아들인다.","마술적 능력":"나는 단지 가능성을 믿는 것만으로 손실을 이익으로, 평범한 것을 특별한 것으로 변화시킨다.","온화함":"나는 땅을 가볍게 밟으며, 사물을 보고 이해하되 결코 완력을 가하지 않는다.","치유":"나는 내 안에서 샘솟는 인내와 평화에 힘입어 언제나 부드럽게 평정을 되찾는다.","소박함":"나는 언제나 사물의 핵심을 봄으로써 참된 것에 머무르며 내 삶을 단순하게 꾸려 나간다.","인내심":"나는 내 행동의 결실이 열매 맺을 때까지 기다릴 줄 안다.","행복감":"살아 있는 기쁨과 좋은 벗과 함께 하는 즐거움은 내 온 존재에 흘러 넘친다.","감상력":"나는 관대한 행위와 순수한 의도 그리고 겉으로 드러나는 숨은 재능을 알아보고 갈채를 보낸다.","결의":"오직 한 가지 목표에 집중하되 유연함을 잃지 않는 나는 목적지를 향해서 사랑을 가지고 끊임없이 나아간다.","유연함":"나는 태평하면서도 주의 깊고, 기쁨이 넘치면서도 평온하다; 나는 대나무처럼 강하면서도 유연하다.","자유로움":"나는 어떤 고정관념에도 얽매이지 않으며, 내적인 능력을 바탕으로 한계를 초월한다. ","순수한 마음":"나는 나의 순수한 자아를 사랑하고, 함께 나누며, 다른 사람들의 순수성과 교감한다.","유머 감각":"놀라운 사건들과 남다른 결과를 보면 나의 정신은 기뻐하며 빛을 발한다.","온정":"나는 형제가 형제를 대하듯이, 그리고 어머니가 자식을 대하듯이 모든 존재를 귀하게 여기고 존중한다.","모험심":"삶의 경이로움은 나를 감동시킨다. 나는 낡은 사고와 이미지에 과감히 도전한다.","관대함":"나는 풍성하게 흘러 넘치며 이기심 없이 기여한다. 그리하여 나를 통해 신의 에너지가 전해진다.","진실함":"나는 모든 관계에 있어서 곧고, 진실하며, 편견 없이 유연하게 대처한다.","직관":"나는 모든 일 속에 흐르는 리듬을 감지하며 순수한 느낌에 따라 행동한다.","고요함":"나는 복잡한 상황 속에서도 안정을 유지하며 불안한 가운데서도 확신을 잃지 않는다. ","존엄성":"나는 변화의 소용돌이 속에서도 평온함을 유지하며, 사람들을 정중하게 대하고 신뢰한다. ","충실함":"나는 내가 한 말에 충실하고 진실하며, 성실하고 일관성 있게 행동에 옮긴다.","강인함":"나는 나 자신과 남들에게 새로운 기운을 불어 넣으며, 굳은 의지로 받쳐 준다.","만족":"내가 필요로 하는 것은 바닷물이 들어 오듯이 때가 되면 나에게로 올 것임을 알기에 나는 삶을 있는 그대로 즐긴다.","존중심":"각 사람마다 고유한 가치가 있음을 알기 때문에,\n 나는 아무리 보잘것없는 역할이라도 그 귀중함을 안다.","평화로움":"나는 대단히 고요한 마음으로 내 마음의 흐름을 지켜 보며 침묵을 수용한다.","아름다움":"나는 나 자신과 남들에게서 사랑스러움을 발견하며, 우리 각자가 지닌 고유하고 소중한 내면의 아름다움을 본다.","열의":"나는 꿈과 이상을 창조하며, 일이 진행될 수 있도록 활력을 불어 넣는다.","다정함":"모든 것에 선함이 깃들어 있음을 알기에 나는 슬픔의 그림자를 초월해 있다."};
virtueMap = {0: "안정감", 1: "안정감", 2: "안정감", 3: "안정감", 4: "안정감", 5: "안정감", 6: "안정감", 7: "안정감", 8: "명랑함", 9: "명랑함", 10: "명랑함", 11: "명랑함", 12: "명랑함", 13: "명랑함", 14: "명랑함", 15: "사랑", 16: "사랑", 17: "사랑", 18: "사랑", 19: "사랑", 20: "사랑", 21: "사랑", 22: "사랑", 23: "관용", 24: "관용", 25: "관용", 26: "관용", 27: "관용", 28: "관용", 29: "관용", 30: "관용", 31: "변함 없음", 32: "변함 없음", 33: "변함 없음", 34: "변함 없음", 35: "변함 없음", 36: "변함 없음", 37: "변함 없음", 38: "겸손", 39: "겸손", 40: "겸손", 41: "겸손", 42: "겸손", 43: "겸손", 44: "겸손", 45: "겸손", 46: "협동심", 47: "협동심", 48: "협동심", 49: "협동심", 50: "협동심", 51: "협동심", 52: "협동심", 53: "협동심", 54: "자신에 대한 신뢰", 55: "자신에 대한 신뢰", 56: "자신에 대한 신뢰", 57: "자신에 대한 신뢰", 58: "자신에 대한 신뢰", 59: "자신에 대한 신뢰", 60: "자신에 대한 신뢰", 61: "성실성", 62: "성실성", 63: "성실성", 64: "성실성", 65: "성실성", 66: "성실성", 67: "성실성", 68: "성실성", 69: "지혜로움", 70: "지혜로움", 71: "지혜로움", 72: "지혜로움", 73: "지혜로움", 74: "지혜로움", 75: "지혜로움", 76: "지혜로움", 77: "초연함", 78: "초연함", 79: "초연함", 80: "초연함", 81: "초연함", 82: "초연함", 83: "초연함", 84: "정직함", 85: "정직함", 86: "정직함", 87: "정직함", 88: "정직함", 89: "정직함", 90: "정직함", 91: "정직함", 92: "창의성", 93: "창의성", 94: "창의성", 95: "창의성", 96: "창의성", 97: "창의성", 98: "창의성", 99: "창의성", 100: "용기", 101: "용기", 102: "용기", 103: "용기", 104: "용기", 105: "용기", 106: "용기", 107: "긍정적 소망", 108: "긍정적 소망", 109: "긍정적 소망", 110: "긍정적 소망", 111: "긍정적 소망", 112: "긍정적 소망", 113: "긍정적 소망", 114: "긍정적 소망", 115: "실용적", 116: "실용적", 117: "실용적", 118: "실용적", 119: "실용적", 120: "실용적", 121: "실용적", 122: "실용적", 123: "유능함", 124: "유능함", 125: "유능함", 126: "유능함", 127: "유능함", 128: "유능함", 129: "유능함", 130: "보살핌", 131: "보살핌", 132: "보살핌", 133: "보살핌", 134: "보살핌", 135: "보살핌", 136: "보살핌", 137: "보살핌", 138: "책임감", 139: "책임감", 140: "책임감", 141: "책임감", 142: "책임감", 143: "책임감", 144: "책임감", 145: "책임감", 146: "신뢰", 147: "신뢰", 148: "신뢰", 149: "신뢰", 150: "신뢰", 151: "신뢰", 152: "신뢰", 153: "마술적 능력", 154: "마술적 능력", 155: "마술적 능력", 156: "마술적 능력", 157: "마술적 능력", 158: "마술적 능력", 159: "마술적 능력", 160: "마술적 능력", 161: "온화함", 162: "온화함", 163: "온화함", 164: "온화함", 165: "온화함", 166: "온화함", 167: "온화함", 168: "온화함", 169: "치유", 170: "치유", 171: "치유", 172: "치유", 173: "치유", 174: "치유", 175: "치유", 176: "소박함", 177: "소박함", 178: "소박함", 179: "소박함", 180: "소박함", 181: "소박함", 182: "소박함", 183: "소박함", 184: "인내심", 185: "인내심", 186: "인내심", 187: "인내심", 188: "인내심", 189: "인내심", 190: "인내심", 191: "행복감", 192: "행복감", 193: "행복감", 194: "행복감", 195: "행복감", 196: "행복감", 197: "행복감", 198: "행복감", 199: "감상력", 200: "감상력", 201: "감상력", 202: "감상력", 203: "감상력", 204: "감상력", 205: "감상력", 206: "감상력", 207: "결의", 208: "결의", 209: "결의", 210: "결의", 211: "결의", 212: "결의", 213: "결의", 214: "유연함", 215: "유연함", 216: "유연함", 217: "유연함", 218: "유연함", 219: "유연함", 220: "유연함", 221: "유연함", 222: "자유로움", 223: "자유로움", 224: "자유로움", 225: "자유로움", 226: "자유로움", 227: "자유로움", 228: "자유로움", 229: "자유로움", 230: "순수한 마음", 231: "순수한 마음", 232: "순수한 마음", 233: "순수한 마음", 234: "순수한 마음", 235: "순수한 마음", 236: "순수한 마음", 237: "유머 감각", 238: "유머 감각", 239: "유머 감각", 240: "유머 감각", 241: "유머 감각", 242: "유머 감각", 243: "유머 감각", 244: "유머 감각", 245: "온정", 246: "온정", 247: "온정", 248: "온정", 249: "온정", 250: "온정", 251: "온정", 252: "온정", 253: "모험심", 254: "모험심", 255: "모험심", 256: "모험심", 257: "모험심", 258: "모험심", 259: "모험심", 260: "관대함", 261: "관대함", 262: "관대함", 263: "관대함", 264: "관대함", 265: "관대함", 266: "관대함", 267: "관대함", 268: "진실함", 269: "진실함", 270: "진실함", 271: "진실함", 272: "진실함", 273: "진실함", 274: "진실함", 275: "진실함", 276: "직관", 277: "직관", 278: "직관", 279: "직관", 280: "직관", 281: "직관", 282: "직관", 283: "고요함", 284: "고요함", 285: "고요함", 286: "고요함", 287: "고요함", 288: "고요함", 289: "고요함", 290: "고요함", 291: "존엄성", 292: "존엄성", 293: "존엄성", 294: "존엄성", 295: "존엄성", 296: "존엄성", 297: "존엄성", 298: "존엄성", 299: "충실함", 300: "충실함", 301: "충실함", 302: "충실함", 303: "충실함", 304: "충실함", 305: "충실함", 306: "강인함", 307: "강인함", 308: "강인함", 309: "강인함", 310: "강인함", 311: "강인함", 312: "강인함", 313: "강인함", 314: "만족", 315: "만족", 316: "만족", 317: "만족", 318: "만족", 319: "만족", 320: "만족", 321: "만족", 322: "존중심", 323: "존중심", 324: "존중심", 325: "존중심", 326: "존중심", 327: "존중심", 328: "존중심", 329: "평화로움", 330: "평화로움", 331: "평화로움", 332: "평화로움", 333: "평화로움", 334: "평화로움", 335: "평화로움", 336: "평화로움", 337: "아름다움", 338: "아름다움", 339: "아름다움", 340: "아름다움", 341: "아름다움", 342: "아름다움", 343: "아름다움", 344: "아름다움", 345: "열의", 346: "열의", 347: "열의", 348: "열의", 349: "열의", 350: "열의", 351: "열의", 352: "다정함", 353: "다정함", 354: "다정함", 355: "다정함", 356: "다정함", 357: "다정함", 358: "다정함", 359: "다정함"};
backColors = {"안정감": "#f8455b", "명랑함": "#ce8304", "사랑": "#808000", "관용": "#f7e017", "변함 없음": "#cac7b7", "겸손": "#b571f9", "협동심": "#ff5b5b", "자신에 대한 신뢰": "#ff6fb7", "성실성": "#579c29", "지혜로움": "#e0b634", "초연함": "#e873bf", "정직함": "#18bfe9", "창의성": "#7c5eb7", "용기": "#ed9129", "긍정적 소망": "#f2f810", "실용적": "#5b89df", "유능함": "#c789de", "보살핌": "#d0c6d7", "책임감": "#8080ff", "신뢰": "#9f9f00", "마술적 능력": "#e0d82e", "온화함": "#00a800", "치유": "#ff8080", "소박함": "#0080c0", "인내심": "#ffff20", "행복감": "#ea8a57", "감상력": "#8080c0", "결의": "#00a6a6", "유연함": "#0080c0", "자유로움": "#a33cca", "순수한 마음": "#dab42e", "유머 감각": "#ed8127", "온정": "#26eaea", "모험심": "#9667e4", "관대함": "#3c9f9d", "진실함": "#93501e", "직관": "#da2c27", "고요함": "#a9b553", "존엄성": "#ff8040", "충실함": "#d6b143", "강인함": "#8080ff", "만족": "#875be1", "존중심": "#bcce1a", "평화로움": "#ffd50b", "아름다움": "#628639", "열의": "#71e100", "다정함": "#82c0f4"};
foregroundColor = {"안정감": "#000000", "명랑함": "#000000", "사랑": "#000000", "관용": "#000000", "변함 없음": "#000000", "겸손": "#000000", "협동심": "#000000", "자신에 대한 신뢰": "#000000", "성실성": "#000000", "지혜로움": "#000000", "초연함": "#000000", "정직함": "#000000", "창의성": "#000000", "용기": "#000000", "긍정적 소망": "#000000", "실용적": "#000000", "유능함": "#000000", "보살핌": "#000000", "책임감": "#000000", "신뢰": "#000000", "마술적 능력": "#000000", "온화함": "#000000", "치유": "#000000", "소박함": "#000000", "인내심": "#000000", "행복감": "#000000", "감상력": "#000000", "결의": "#000000", "유연함": "#000000", "자유로움": "#000000", "순수한 마음": "#000000", "유머 감각": "#000000", "온정": "#000000", "모험심": "#000000", "관대함": "#000000", "진실함": "#000000", "직관": "#000000", "고요함": "#000000", "존엄성": "#000000", "충실함": "#000000", "강인함": "#000000", "만족": "#000000", "존중심": "#000000", "평화로움": "#000000", "아름다움": "#000000", "열의": "#000000"};

var months = [
    "1월",
    "2월",
    "3월",
    "4월",
    "5월",
    "6월",
    "7월",
    "8월",
    "9월",
    "10월",
    "11월",
    "12월"
];

var virtueImages = {
};

var i18n = {
    "OK": "OK",
    "Cancel": "Cancel",
    "Hide history": "기록 감추기",
    "No history yet": "기록 없음",
    "Date": "날짜",
    "Virtue": "미덕",
    "Hide": "감추기",
    "Show": "보여주기",
    "Work in progress": "진행중",
    "Next month": "다음 달",
    "Show history": "기록 보여주기",
    "Hide Images": "이미지 감추기",
    "Show Images": "이미지 보여주기",
    "Cards with text will be displayed.": "카드 내용이 표시됩니다.",
    "Start Year Plan": "나의 미덕 알아보기",
    "Restart": "새로 시작하기",
    "Download PDF": "PDF를 다운로드.",
    "Pause": "멈추기",
    "Play": "시작",
    "Play again": "Spin again",
    "Send Email": "이메일로 보내기",
    "Virtuescope": "미덕 찾기",
    "Please enter your email": "이메일을 입력하세요",
    "Please wait": " 기다리세요",
    "Email sent successfully !": "이메일이 발송되었습니다!",
    "Email could not be sent (how embarassing !). Please download the PDF.": "이메일이 발송되지 못했습니다(당황스럽군요!). PDF를 다운로드 하세요.",
    "introText": "Every day spin the wheel and enjoy the magic : keeping in mind that quality, see how it colours your thoughts, your environment, your world."
};

var plans = {
    "12 months": "12개월",
    "6 months": "6개월",
    "4 months": "4개월",
    "3 months": "3개월",
    "7 days": "7일",
    "15 days": "15일"
};

var plansLength = {
    "12 months": "12",
    "6 months": "6",
    "4 months": "4",
    "3 months": "3",
    "7 days": "7d",
    "15 days": "15d"
};

var getGlobalLocale = function() {
    return "ko_KR";
};
